[
  {
    "id": "1",
    "name": "technology",
    "description": "Discussion about technology, programming, gadgets, and the latest tech trends. Share news, insights, and engage in thoughtful discussions about how technology shapes our world.",
    "memberCount": 125000,
    "createdAt": "2020-03-15T10:00:00Z",
    "isSubscribed": true
  },
  {
    "id": "2",
    "name": "programming",
    "description": "A community for programmers to discuss code, algorithms, career advice, and development best practices. Whether you're a beginner or expert, all skill levels are welcome.",
    "memberCount": 89000,
    "createdAt": "2019-11-22T08:30:00Z",
    "isSubscribed": false
  },
  {
    "id": "3",
    "name": "gaming",
    "description": "Everything gaming related - from indie titles to AAA releases, retro classics to cutting-edge VR experiences. Share reviews, gameplay clips, and connect with fellow gamers.",
    "memberCount": 156000,
    "createdAt": "2018-07-08T14:20:00Z",
    "isSubscribed": true
  },
  {
    "id": "4",
    "name": "science",
    "description": "Explore the wonders of scientific discovery! Share research findings, discuss breakthroughs, and engage in evidence-based discussions about our universe and how it works.",
    "memberCount": 98000,
    "createdAt": "2019-01-12T11:45:00Z",
    "isSubscribed": false
  },
  {
    "id": "5",
    "name": "music",
    "description": "A harmonious community for music lovers of all genres. Share your favorite tracks, discover new artists, discuss concerts, and connect through the universal language of music.",
    "memberCount": 76000,
    "createdAt": "2020-05-03T16:10:00Z",
    "isSubscribed": true
  },
  {
    "id": "6",
    "name": "movies",
    "description": "Lights, camera, discussion! Share reviews, theories, behind-the-scenes content, and celebrate the art of filmmaking with fellow cinema enthusiasts.",
    "memberCount": 112000,
    "createdAt": "2018-12-18T09:25:00Z",
    "isSubscribed": false
  },
  {
    "id": "7",
    "name": "photography",
    "description": "Capture and share the world through your lens. Get feedback on your work, learn new techniques, and be inspired by the creative vision of photographers worldwide.",
    "memberCount": 67000,
    "createdAt": "2019-08-14T13:15:00Z",
    "isSubscribed": true
  },
  {
    "id": "8",
    "name": "books",
    "description": "A literary haven for book lovers! Discuss your latest reads, get recommendations, share reviews, and connect with fellow bibliophiles who share your passion for the written word.",
    "memberCount": 54000,
    "createdAt": "2020-02-07T10:40:00Z",
    "isSubscribed": false
  },
  {
    "id": "9",
    "name": "art",
    "description": "Express your creativity and appreciate artistic expression in all its forms. Share your work, get constructive feedback, and be inspired by the diverse artistic community.",
    "memberCount": 43000,
    "createdAt": "2019-06-25T15:30:00Z",
    "isSubscribed": true
  },
  {
    "id": "10",
    "name": "sports",
    "description": "The ultimate destination for sports enthusiasts! Discuss games, share highlights, analyze performance, and connect with fans who share your passion for athletic competition.",
    "memberCount": 91000,
    "createdAt": "2018-10-11T12:50:00Z",
    "isSubscribed": false
  }
]